-- phpMyAdmin SQL Dump
-- version 4.6.5.2
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Час створення: Квт 17 2017 р., 14:07
-- Версія сервера: 5.5.53
-- Версія PHP: 5.5.38

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База даних: `mercer`
--

-- --------------------------------------------------------

--
-- Структура таблиці `comments`
--

CREATE TABLE `comments` (
  `id` int(11) NOT NULL,
  `id_post` int(11) NOT NULL,
  `content_comments` text COLLATE utf8_unicode_ci NOT NULL,
  `id_author` int(11) NOT NULL,
  `date_comm` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `id_parent_comments` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Дамп даних таблиці `comments`
--

INSERT INTO `comments` (`id`, `id_post`, `content_comments`, `id_author`, `date_comm`, `id_parent_comments`) VALUES
(40, 1, 'Вітаємо!', 1, '2017-04-13 17:11:58', 0),
(73, 23, 'qwerty', 0, '2017-04-14 11:54:00', 0),
(74, 23, 'werwerwerwe', 0, '2017-04-14 11:54:27', 0),
(75, 23, 'aaaaaaaaaaaaa', 1, '2017-04-14 11:59:20', 0),
(76, 23, 'sadsasa', 0, '2017-04-14 12:04:25', 0),
(77, 23, 'qwe', 1, '2017-04-14 12:04:55', 0),
(78, 23, ',,,,,,,,,,,,,,,,,,,,,,,', 1, '2017-04-14 12:05:10', 0),
(79, 23, 'erwwwwwwwwwwwwwwwww', 1, '2017-04-14 12:05:19', 0),
(80, 23, 'віаіваів', 0, '2017-04-14 12:06:14', 0),
(81, 23, 'ввввввввввввв', 1, '2017-04-14 12:06:18', 0),
(82, 23, 'ваів', 0, '2017-04-14 12:06:21', 0),
(83, 23, 'классс', 0, '2017-04-14 12:06:26', 0),
(84, 23, 'на ентер', 0, '2017-04-14 12:06:30', 0),
(85, 23, 'урааа', 0, '2017-04-14 12:06:33', 0),
(86, 23, 'еуые', 1, '2017-04-14 12:14:16', 0),
(87, 23, '1', 1, '2017-04-14 12:22:08', 0),
(88, 23, '45', 1, '2017-04-14 12:23:07', 0),
(89, 23, 'цук', 1, '2017-04-14 12:23:24', 0),
(90, 21, 'фыав', 1, '2017-04-14 12:24:43', 0),
(91, 21, 'ыфвфыаааыа', 1, '2017-04-14 12:24:53', 0),
(92, 23, 'йййййййййййййййййййййййййййй', 1, '2017-04-14 12:25:05', 0),
(93, 23, '123', 1, '2017-04-14 12:25:18', 0),
(94, 23, '123', 1, '2017-04-14 12:25:34', 0),
(95, 23, 'аааааааааааааааааааааааааааааааааа', 1, '2017-04-14 12:25:47', 0),
(96, 23, 'Лвщудвд', 0, '2017-04-14 13:18:30', 0),
(97, 23, '12', 0, '2017-04-14 15:19:01', 0),
(98, 23, '222', 0, '2017-04-14 15:19:10', 0),
(99, 23, '123', 0, '2017-04-14 15:19:12', 0),
(100, 23, 'dsfcsd', 0, '2017-04-14 15:28:08', 0),
(101, 23, 'qw', 0, '2017-04-14 15:41:59', 0),
(102, 23, 'есть', 0, '2017-04-14 15:46:02', 0),
(103, 23, 'скролл', 0, '2017-04-14 15:47:03', 0),
(104, 1, '123', 0, '2017-04-14 15:55:58', 0),
(105, 23, 'sss', 0, '2017-04-14 16:10:15', 0),
(106, 23, 'hjdhsj', 0, '2017-04-14 16:10:25', 0),
(107, 23, 'sdsdsd', 0, '2017-04-14 16:10:29', 0),
(108, 23, ' ', 0, '2017-04-14 16:11:05', 0),
(109, 23, 'Нормально виглядає?', 0, '2017-04-14 17:20:34', 0),
(110, 23, 'провірка', 0, '2017-04-14 17:21:06', 0),
(111, 24, 'провірка комента', 2, '2017-04-14 17:23:57', 0),
(112, 24, 'там знак питання знизу откудась', 2, '2017-04-14 17:24:22', 0),
(113, 24, '? где-то в хтмл ко впихнул', 1, '2017-04-14 17:31:46', 0),
(114, 24, '*код', 1, '2017-04-14 17:31:52', 0),
(115, 24, 'большое расстояние между комментами', 1, '2017-04-14 17:32:15', 0),
(116, 24, 'продублируй крестик закрыть новость вниз около самолётика', 1, '2017-04-14 17:32:50', 0),
(117, 24, 'в блок іменно?', 2, '2017-04-14 17:49:10', 0),
(118, 24, 'чи просто біля десь', 2, '2017-04-14 17:49:24', 0),
(119, 24, 'ну прямо около самолёта', 1, '2017-04-14 17:51:35', 0),
(120, 24, 'тест', 0, '2017-04-14 18:36:05', 0),
(121, 24, 'тест2', 0, '2017-04-14 18:36:32', 0),
(122, 24, 'ert', 0, '2017-04-14 18:47:01', 0),
(123, 21, ' ', 0, '2017-04-14 19:11:42', 0),
(124, 21, 'dsad', 0, '2017-04-14 19:11:51', 0),
(125, 1, 'успіхів', 0, '2017-04-14 19:12:12', 0),
(126, 2, 'круто', 0, '2017-04-14 19:12:22', 0),
(127, 2, 'круто', 0, '2017-04-14 19:12:35', 0),
(128, 25, 'ntcn', 0, '2017-04-15 13:11:18', 0),
(129, 25, 'test2', 0, '2017-04-15 13:11:24', 0),
(130, 25, 'e', 0, '2017-04-15 16:59:55', 0),
(131, 25, 'коментарий й', 0, '2017-04-15 20:36:10', 0),
(132, 25, 'тест', 1, '2017-04-17 10:10:29', 0),
(133, 24, 'lll', 0, '2017-04-17 10:44:41', 0),
(134, 1, 'ssasdas', 0, '2017-04-17 10:45:12', 0),
(135, 25, 'dedd', 0, '2017-04-17 10:48:57', 0),
(136, 1, 'dsds', 0, '2017-04-17 10:49:10', 0),
(137, 1, 'ddd', 0, '2017-04-17 10:49:15', 0),
(138, 26, 'коментарій гостя', 0, '2017-04-17 11:04:59', 0),
(139, 26, 'коментарій користувача', 2, '2017-04-17 11:05:43', 0);

-- --------------------------------------------------------

--
-- Структура таблиці `event`
--

CREATE TABLE `event` (
  `id` int(11) NOT NULL,
  `author_post` int(11) NOT NULL,
  `date_post` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `title_post` text COLLATE utf8_unicode_ci NOT NULL,
  `content_post` text COLLATE utf8_unicode_ci NOT NULL,
  `ccomm` int(11) DEFAULT NULL,
  `cview` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Дамп даних таблиці `event`
--

INSERT INTO `event` (`id`, `author_post`, `date_post`, `title_post`, `content_post`, `ccomm`, `cview`) VALUES
(1, 1, '2017-04-05 21:00:00', 'II етап X Всеукраїнської олімпіади з інформатики та КТ', '5 квітня 2017р. у Природничо-гуманітарному коледжі ДВНЗ «УжНУ» відбувся II етап X Всеукраїнської олімпіади з інформатики та комп’ютерної техніки. Участь у заході взяло 5 команд із ВНЗ I-II рівнів акредитації Закарпатської області.\r\n\r\nІз вітальним словом до учасників олімпіади звернувся директор коледжу Росоха В.В.\r\n\r\nНа  урочистому відкритті виступив завідувач кафедри інформатики та фізико-математичних дисциплін факультету інформаційних технологій, кандидат фізико-математичних наук доцент Лавер О.Г.\r\n\r\nУчасники протягом 3год. доводили свій високий рівень знань та практичних  навиків з інформатики.\r\n\r\nОрганізатори олімпіади для проведення заходу та об’єктивного, неупередженого оцінювання застосували одразу два програмні продукти: систему тестування BrainTester для теоретичної частини та власну розробку «ProzzoraОлімпіада» для практичної частини. Делегати навчальних закладів, що увійшли до складу журі, високо оцінили можливості програми «ProzzoraОлімпіада» і рекомендували подальше її використання у такого роду заходах.\r\n\r\nКомпетентне журі на чолі з організатором олімпіади, головою циклової комісії програмування та інформаційних технологій Александрою Н.В об’єктивно оцінили олімпіадні роботи і визначило заслужених переможців.\r\n\r\nI  місце посів Грінчук Віталій, студент II курсу  спеціальності «Розробка програмного забезпечення» Природничо-гуманітарного коледжу ДВНЗ «УжНУ»;\r\n\r\nII місце присуджено Білі Себастьяну, студенту ІІ курсу  спеціальності «Розробка програмного забезпечення» Природничо-гуманітарного коледжу ДВНЗ «УжНУ»;\r\n\r\nІІІ місце заслужено отримала Коденко Крістіна, студентка ВП НУБіП України «Мукачівський аграрний коледж».\r\n\r\nОтож честь нашого краю на ІІІ етапі Всеукраїнської олімпіади буде відстоювати наш студент Віталій Грінчук.\r\n\r\nЩиро вітаємо переможців та їх наставників. Бажаємо подальших здобутків та здійснення усіх задумів!', 0, 9),
(2, 2, '2017-03-31 21:00:00', 'Суботник', 'Цієї суботи, 1 квітня, усі студенти та викладачі  Природничо-гуманітарного коледжу  ДВНЗ «УжНУ» взяли участь у масовому прибиранні території навчального закладу та прилеглих вулиць. Суботник відбувався у натхненній атмосфері добра, весняного настрою та позитивних емоцій. Куратори разом зі своїми академгрупами виконали всю необхідну роботу, заплановану адміністрацією напередодні:  здійснено генеральне прибирання у гуртожитку та у навчальних аудиторіях коледжу, приведено до ладу спортмайданчики, територію навчального закладу, очищено узбіччя та кювети вздовж вулиць Антонівської та Української. Із веселим настроєм та ентузіазмом дівчата-студентки саджали квіти, упорядковували клумби; хлопці – обкопували та фарбували дерева.\r\n\r\nМолоді люди переконані, що праця –  це найкращий шлях до того, щоб любити життя. Безумовно, всі добровільно долучилися до цього цікавого та корисного заходу.\r\n\r\nЗа словами В.Сухомлинського: «Праця – найкращий шлях до того, щоб любити життя – це одне з найчистіших і найшляхетніших джерел емоційного стану, радості діяння, творення. Думка, що народжена, збуджена, витончена в праці, стає радісною, оптимістичною».', 0, 27);

-- --------------------------------------------------------

--
-- Структура таблиці `posts`
--

CREATE TABLE `posts` (
  `id` int(11) NOT NULL,
  `author_post` int(11) NOT NULL,
  `date_post` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `title_post` text COLLATE utf8_unicode_ci NOT NULL,
  `content_post` text COLLATE utf8_unicode_ci NOT NULL,
  `ccomm` int(11) NOT NULL,
  `cview` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Дамп даних таблиці `posts`
--

INSERT INTO `posts` (`id`, `author_post`, `date_post`, `title_post`, `content_post`, `ccomm`, `cview`) VALUES
(1, 1, '2017-04-05 21:00:00', 'II етап X Всеукраїнської олімпіади з інформатики та КТ', '5 квітня 2017р. у Природничо-гуманітарному коледжі ДВНЗ «УжНУ» відбувся II етап X Всеукраїнської олімпіади з інформатики та комп’ютерної техніки. Участь у заході взяло 5 команд із ВНЗ I-II рівнів акредитації Закарпатської області.\r\n\r\nІз вітальним словом до учасників олімпіади звернувся директор коледжу Росоха В.В.\r\n\r\nНа  урочистому відкритті виступив завідувач кафедри інформатики та фізико-математичних дисциплін факультету інформаційних технологій, кандидат фізико-математичних наук доцент Лавер О.Г.\r\n\r\nУчасники протягом 3год. доводили свій високий рівень знань та практичних  навиків з інформатики.\r\n\r\nОрганізатори олімпіади для проведення заходу та об’єктивного, неупередженого оцінювання застосували одразу два програмні продукти: систему тестування BrainTester для теоретичної частини та власну розробку «ProzzoraОлімпіада» для практичної частини. Делегати навчальних закладів, що увійшли до складу журі, високо оцінили можливості програми «ProzzoraОлімпіада» і рекомендували подальше її використання у такого роду заходах.\r\n\r\nКомпетентне журі на чолі з організатором олімпіади, головою циклової комісії програмування та інформаційних технологій Александрою Н.В об’єктивно оцінили олімпіадні роботи і визначило заслужених переможців.\r\n\r\nI  місце посів Грінчук Віталій, студент II курсу  спеціальності «Розробка програмного забезпечення» Природничо-гуманітарного коледжу ДВНЗ «УжНУ»;\r\n\r\nII місце присуджено Білі Себастьяну, студенту ІІ курсу  спеціальності «Розробка програмного забезпечення» Природничо-гуманітарного коледжу ДВНЗ «УжНУ»;\r\n\r\nІІІ місце заслужено отримала Коденко Крістіна, студентка ВП НУБіП України «Мукачівський аграрний коледж».\r\n\r\nОтож честь нашого краю на ІІІ етапі Всеукраїнської олімпіади буде відстоювати наш студент Віталій Грінчук.\r\n\r\nЩиро вітаємо переможців та їх наставників. Бажаємо подальших здобутків та здійснення усіх задумів!', 6, 161),
(2, 2, '2017-03-31 21:00:00', 'Суботник', 'Цієї суботи, 1 квітня, усі студенти та викладачі  Природничо-гуманітарного коледжу  ДВНЗ «УжНУ» взяли участь у масовому прибиранні території навчального закладу та прилеглих вулиць. Суботник відбувався у натхненній атмосфері добра, весняного настрою та позитивних емоцій. Куратори разом зі своїми академгрупами виконали всю необхідну роботу, заплановану адміністрацією напередодні:  здійснено генеральне прибирання у гуртожитку та у навчальних аудиторіях коледжу, приведено до ладу спортмайданчики, територію навчального закладу, очищено узбіччя та кювети вздовж вулиць Антонівської та Української. Із веселим настроєм та ентузіазмом дівчата-студентки саджали квіти, упорядковували клумби; хлопці – обкопували та фарбували дерева.\r\n\r\nМолоді люди переконані, що праця –  це найкращий шлях до того, щоб любити життя. Безумовно, всі добровільно долучилися до цього цікавого та корисного заходу.\r\n\r\nЗа словами В.Сухомлинського: «Праця – найкращий шлях до того, щоб любити життя – це одне з найчистіших і найшляхетніших джерел емоційного стану, радості діяння, творення. Думка, що народжена, збуджена, витончена в праці, стає радісною, оптимістичною».', 2, 51),
(21, 1, '2017-04-13 18:57:42', 'Про термінове ПІДПИСАННЯ Закону України 5240', 'Верховна Рада України 21 березня 2017 року ухвалила Закон України 5240 \"Про внесення змін до Закону України \"Про вищу освіту\" щодо освітньо-кваліфікаційного рівня \"молодший спеціаліст\", яким до 2019 року врегулювала катастрофічну ситуацію, що склалась із підготовкою фахівців ОКР \"молодший спеціаліст\" технікумами і коледжами України.\r\nПросимо Вас терміново підписати Закон України 5240 \"Про внесення змін до Закону України \"Про вищу освіту\" щодо освітньо-кваліфікаційного рівня \"молодший спеціаліст\" з метою забезпечення права молоді вільного вибору освітньої траєкторії та уникнення соціального вибуху в освітньому середовищі.', 4, 60),
(24, 2, '2017-04-14 17:23:32', 'Нормально виглядають коментарі?', 'Якшо шось не так то кажіть', 13, 62),
(25, 1, '2017-04-14 19:15:04', 'Відбулася ІІІ обласна олімпіада–конкурс «Юний інформатик»', '01 березня відбулася ІІІ обласна олімпіада–конкурс «Юний інформатик». До участі в олімпіаді зареєструвалися 20 учнів 8-9 класів загальноосвітніх шкіл І-ІІІ ступенів м.Ужгорода.\r\n\r\nУрочисте відкриття олімпіади розпочалося зі вступного слова директора коледжу Росохи В.В. Наших гостей привітали голова журі  – кандидат технічних наук, доцент, завідувач кафедри інформаційних управляючих систем та технологій Міца О.В. та кандидат фізико-математичних дисциплін, доцент, завідувач кафедри інформатики та фізико-математичних дисциплін Лавер О.Г., які привітали конкурсантів та запросили на навчання як до коледжу, так і в подальшому – на факультет інформаційних технологій Державного вищого навчального закладу «Ужгородський національний університет».\r\n\r\nУчні 8-9 класів виконали 10 письмових завдань і тестування з інформатики в комп’ютерній залі. Компетентне журі у складі досвідчених викладачів Мокрянин Я.І., Лінчук Н.Л., Готько Е.О., Щербана І.І. та Лукавської А.В. визначило переможців за підсумками двох етапів.\r\n\r\nНими стали такі конкурсанти:\r\n\r\nІ місце\r\n\r\nКоштура Павло, учень ЗОШ І-ІІІ ст. № 12 м. Ужгорода;\r\nІІ місце\r\n\r\nНеймет Володимир, учень ЗОШ І-ІІІ ст. № 6 ім.В.С.Гренджі-Донського м.Ужгорода;\r\nЛісіцин Максиміліан, ЗОШ І-ІІІ ст. № 12 м. Ужгорода\r\nІІІ місце\r\n\r\nГрейцер Богдан, учень Лінгвістичної гімназії м.Ужгорода;\r\nГнатишена Марія, учениця ЗОШ І-ІІІ ст. № 6 ім.В.С.Гренджі-Донського м.Ужгорода;\r\nВолошин Артем, учень ЗОШ І-ІІІ ст. № 12 м. Ужгорода;\r\nМиголинець Олександр, учень ЗОШ І-ІІІ ст. № 12 м. Ужгорода.\r\nНа урочистому закритті олімпіади-конкурсу перед учасниками виступив голова Студентського наукового товариства Куклишин Михайло, який розповів присутнім про принади фаху інформатика-програміста. Всі учасники були нагороджені дипломами, а переможці – грамотами,  сертифікатами на безкоштовне відвідування підготовчих курсів та заохочувальними призами.\r\n\r\nПедагогічний та студентський колективи коледжу щиро вітають призерів та учасників! Запрошуємо до нашої дружної сім’ї!\r\n\r\nХай Вам щастить на вступних випробуваннях!\r\n\r\nДо зустрічі 1 вересня!', 6, 60),
(26, 19, '2017-04-17 10:51:13', 'Перевірка', 'Створення новини на Опен Сервері', 2, 3);

-- --------------------------------------------------------

--
-- Структура таблиці `users`
--

CREATE TABLE `users` (
  `id` int(11) NOT NULL,
  `userstatus` varchar(10) COLLATE utf8_unicode_ci NOT NULL,
  `login` varchar(20) COLLATE utf8_unicode_ci NOT NULL,
  `password` varchar(11) COLLATE utf8_unicode_ci NOT NULL,
  `user_name` text COLLATE utf8_unicode_ci NOT NULL,
  `email` varchar(30) COLLATE utf8_unicode_ci NOT NULL,
  `avatar` varchar(20) COLLATE utf8_unicode_ci NOT NULL,
  `comment` text COLLATE utf8_unicode_ci NOT NULL,
  `visits` datetime NOT NULL,
  `date_reg` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Дамп даних таблиці `users`
--

INSERT INTO `users` (`id`, `userstatus`, `login`, `password`, `user_name`, `email`, `avatar`, `comment`, `visits`, `date_reg`) VALUES
(1, 'admin', 'Nata', 'nnn', 'Natalia', 'pustogoemeylabutynemozhe@ru', '', '', '2017-04-17 13:10:19', '2017-04-14 19:58:23'),
(2, 'admin', 'stas', '123', 'Mercer', 'qwedqwd@wedqw', '', '', '2017-04-17 14:05:48', '2017-04-14 19:58:23'),
(10, 'user', 'dgbfcdgbdfd', 'dfwsfrf', 'vfgbgfd', 'asdca@asdc', '', '', '0000-00-00 00:00:00', '2017-04-14 19:58:23'),
(12, 'user', 'wdwesa', 'wdw', 'dswed', 'wdfsdxw@Ws', '', '', '0000-00-00 00:00:00', '2017-04-14 19:58:23'),
(13, 'user', 'ddd', 'DDD', 'ddd', 'ddd@ddd', '', '', '0000-00-00 00:00:00', '2017-04-14 19:58:23'),
(14, 'user', 'nnn', 'nnn', 'nnn', 'nnn@nnn', '', 'fff', '2017-04-12 14:34:33', '2017-04-14 19:58:23'),
(15, 'user', 'ggg', 'ggg', 'ggg', 'ggg@ggg', '', '', '0000-00-00 00:00:00', '2017-04-14 19:58:23'),
(16, 'user', 'kkk', 'kkk', 'kkk', 'kkk@kkk', '', '', '0000-00-00 00:00:00', '2017-04-14 19:58:23'),
(18, 'user', 'aleksnat', 'dasha2005', 'aleksnat', 'aleksnat@ukr.net', '', '', '2017-04-13 21:06:02', '2017-04-14 19:58:23'),
(19, 'user', 'login', '123', 'imya', 'login@ru', '', '', '2017-04-17 13:51:51', '2017-04-17 10:50:12');

--
-- Індекси збережених таблиць
--

--
-- Індекси таблиці `comments`
--
ALTER TABLE `comments`
  ADD PRIMARY KEY (`id`);

--
-- Індекси таблиці `event`
--
ALTER TABLE `event`
  ADD PRIMARY KEY (`id`);

--
-- Індекси таблиці `posts`
--
ALTER TABLE `posts`
  ADD PRIMARY KEY (`id`);

--
-- Індекси таблиці `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `login` (`login`);

--
-- AUTO_INCREMENT для збережених таблиць
--

--
-- AUTO_INCREMENT для таблиці `comments`
--
ALTER TABLE `comments`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=140;
--
-- AUTO_INCREMENT для таблиці `event`
--
ALTER TABLE `event`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;
--
-- AUTO_INCREMENT для таблиці `posts`
--
ALTER TABLE `posts`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=27;
--
-- AUTO_INCREMENT для таблиці `users`
--
ALTER TABLE `users`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=20;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
